---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StoneBump
source: html/ed02731f-c009-2ac5-293f-481f301616d3.htm
---
# Autodesk.Revit.DB.Visual.Stone.StoneBump Property

The property labeled "Type" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StoneBump { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneBumpType".